---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFCUtils.SortCurveLoops(System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
source: html/e85c27ff-a7b8-a489-9aed-79706d08242e.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFCUtils.SortCurveLoops Method

## Syntax (C#)
```csharp
public static IList<IList<CurveLoop>> SortCurveLoops(
	IList<CurveLoop> loops
)
```

## Parameters
- **loops** (`System.Collections.Generic.IList < CurveLoop >`)